d3mocide/Oscilla/firmware-c5/sdkconfig.defaults
# oscilla-c5 defaults. Radio features are enabled as their phases land
# (ROADMAP P2 Wi-Fi, P3 LoRa, P7 BLE/802.15.4); this file records the target
# and the constraints that are true from the first build.

CONFIG_IDF_TARGET="esp32c5"

# The Grove control UART is UART0 (C5 GPIO11 TX / GPIO12 RX, Rev D §3), which
# is also the ROM console. Boot text on the control line is therefore
# unavoidable and the deck parser resynchronises around it (DESIGN §4.2).
# Console output is NOT disabled: it is genuinely useful during bring-up, and
# the protocol is specified to tolerate it (OCP-SPEC §1.1).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Single-core part; the dispatch task must outrank engine tasks so `stop`
# always lands (DESIGN §6.4).
CONFIG_FREERTOS_HZ=1000

# Fault, never hang: a wedged radio must reset the probe rather than strand
# the deck. Bounded waits everywhere (Rev D §4.3).
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
